src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяУстановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWebСервисОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>WebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>ДрайверACOMВесыСПечатьюЭтикеток</name>
      <description>ACOM:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>Драйвер1СФискальныйРегистраторЭмулятор</name>
      <description>BAS Emulator</description>
    </items>
    <items>
      <name>ДрайверCASВесыСПечатьюЭтикеток</name>
      <description>CAS:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесы</name>
      <description>CAS:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверCashalotФискальныйРегистратор</name>
      <description>Cashalot: Программный РРО</description>
    </items>
    <items>
      <name>Драйвер1СWebСервисОборудование</name>
      <description>Web-сервис оборудование</description>
    </items>
    <items>
      <name>ДрайверАртСофтФискальныйРегистратор</name>
      <description>АртСофт: Фискальный регистратор</description>
    </items>
    <items>
      <name>ДрайверАтолДисплеиПокупателя</name>
      <description>АТОЛ:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверАтолСканерыШтрихкода</name>
      <description>АТОЛ:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверАтолСчитывателиМагнитныхКарт</name>
      <description>АТОЛ:Считыватели магнитных карт</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанных</name>
      <description>АТОЛ:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанныхMobileLogistics</name>
      <description>АТОЛ:Терминалы сбора данных MobileLogistics 8.Х</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы</name>
      <description>АТОЛ:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы8X</name>
      <description>АТОЛ:Электронные весы 8.Х</description>
    </items>
    <items>
      <name>ДрайверВебЧекЭквайринговыеТерминалы</name>
      <description>ВебЧек:Эквайринговий термінал</description>
    </items>
    <items>
      <name>ДрайверГексагонПринтераЭтикеток</name>
      <description>Гексагон:Принтера этикеток Zebra и Proton</description>
    </items>
    <items>
      <name>ДрайверГексагонСканерыШтрихкода</name>
      <description>Гексагон:Сканеры штрихкода Proton</description>
    </items>
    <items>
      <name>ДрайверГексагонТерминалыСбораДанных</name>
      <description>Гексагон:Терминалы сбора данных Goods</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателя</name>
      <description>Дисплей покупателя</description>
    </items>
    <items>
      <name>ДрайверККСДисплеиПокупателя</name>
      <description>ККС:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверКлеверенсТерминалыСбораДанных</name>
      <description>Клеверенс:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверКристаллСервисДисплеиПокупателяVikiVision</name>
      <description>Кристалл Сервис:Дисплей покупателя VikiVision</description>
    </items>
    <items>
      <name>ДрайверПриватбанкЭквайринговыеТерминалы</name>
      <description>Приватбанк:Эквайринговые терминалы Ingenico ECRCommX</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкода</name>
      <description>Сканеры штрихкода (COM)</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкодаNative</name>
      <description>Сканеры штрихкода (NativeApi)</description>
    </items>
    <items>
      <name>ДрайверСканкодДисплеиПокупателя</name>
      <description>Сканкод:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанныхNative</name>
      <description>Сканкод:Драйвер для ТСД CipherLAB 8x00 (NativeApi)</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерыШтрихкода</name>
      <description>Сканкод:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанных</name>
      <description>Сканкод:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверСканситиПринтераЭтикеток</name>
      <description>Скансити:Принтер печати этикеток TSC</description>
    </items>
    <items>
      <name>ДрайверСканситиТерминалыСбораДанных</name>
      <description>Скансити:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверScaleCASВесыСПечатьюЭтикеток</name>
      <description>СКЕЙЛ:Весы c печатью этикеток CL5000J</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКарт</name>
      <description>Считыватели магнитных карт</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКартNative</name>
      <description>Считыватели магнитных карт (NativeApi)</description>
    </items>
    <items>
      <name>ДрайверШтрихМВесыСПечатьюЭтикеток</name>
      <description>Штрих-М:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверШтрихМДисплеиПокупателя</name>
      <description>Штрих-М:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверШтрихМТерминалыСбораДанных</name>
      <description>Штрих-М:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверШтрихМЭлектронныеВесы</name>
      <description>Штрих-М:Электронные весы</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяДистрибутивом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженныйДрайвер</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакетаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СнятСПоддержки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПодключаемоеОборудование/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура производит инициализацию параметров устройства.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Параметры = Новый ХранилищеЗначения(Новый Структура());
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура проверяет уникальность наименования элемента справочника
// для данного компьютера.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ПустаяСтрока(Наименование) Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|    1
		|ИЗ
		|    Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|    ПодключаемоеОборудование.Наименование = &Наименование
		|    И ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
		|    И ПодключаемоеОборудование.Ссылка <> &Ссылка
		|");

		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		Запрос.УстановитьПараметр("Ссылка"      , Ссылка);

		Если Не Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Указано неуникальное наименование элемента. Укажите уникальное наименование.';uk='Зазначено не унікальне найменування елементу. Вкажіть унікальне найменування.'"), ЭтотОбъект, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.WebСервисОборудование Тогда
		
		Если ЗначениеЗаполнено(ИдентификаторWebСервисОборудования) Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|    1
			|ИЗ
			|    Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
			|ГДЕ
			|    ПодключаемоеОборудование.ИдентификаторWebСервисОборудования = &ИдентификаторWebСервисОборудования
			|    И ПодключаемоеОборудование.Ссылка <> &Ссылка
			|");
			
			Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", ИдентификаторWebСервисОборудования);
			Запрос.УстановитьПараметр("Ссылка"      , Ссылка);
			
			Если Не Запрос.Выполнить().Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Указан неуникальный идентификатор активного оборудования элемента. Укажите уникальный идентификатор.';uk='Вказаний неунікальний ідентифікатор активного обладнання елемента. Вкажіть унікальний ідентифікатор.'"), ЭтотОбъект, , , Отказ);
			КонецЕсли;
		КонецЕсли;
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("РабочееМесто");
		
		Если НЕ ИндексЭлемента = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	Иначе
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ИдентификаторWebСервисОборудования");
		Если НЕ ИндексЭлемента = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура производит очистку реквизитов, которые не должны копироваться.
// Следующие реквизиты очищаются при копировании:
// "Параметры"      - параметры устройства сбрасываются в Неопределено;
// "Наименование"   - устанавливается отличное от исходного наименования;
Процедура ПриКопировании(ОбъектКопирования)
	
	УстройствоИспользуется = Истина;
	Параметры = Неопределено;

	Наименование = НСтр("ru='%Наименование% (копия)';uk='%Наименование% (копія)'");
	Наименование = СтрЗаменить(Наименование, "%Наименование%", ОбъектКопирования.Наименование);
	
КонецПроцедуры

// При записи
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ТипОборудования")
			И ДанныеЗаполнения.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.WebСервисОборудование Тогда
			
			ДрайверОборудования = Справочники.ДрайверыОборудования.Драйвер1СWebСервисОборудование;
			
			Если ДанныеЗаполнения.Свойство("РабочееМесто") Тогда
				РабочееМесто = Неопределено;
				ДанныеЗаполнения.РабочееМесто = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
